{
    "common": {
        "name": "ds18b20",
        "version": "1.0.3",
        "news": {
            "1.0.3": {
                "en": "Added documentation about DS18B20 at a Raspberry Pi; Dependencies updated",
                "de": "Dokumentation zu DS18B20 an einem Raspberry Pi hinzugefügt; Abhängigkeiten aktualisiert",
                "ru": "Добавлена документация по DS18B20 на Raspberry Pi; Зависимости обновлены",
                "pt": "Adicionada documentação sobre o DS18B20 em um Raspberry Pi; Dependências atualizadas",
                "nl": "Documentatie toegevoegd over DS18B20 op een Raspberry Pi; Afhankelijkheden bijgewerkt",
                "fr": "Ajout de la documentation sur le DS18B20 sur un Raspberry Pi; Dépendances mises à jour",
                "it": "Aggiunta documentazione su DS18B20 su un Raspberry Pi; Dipendenze aggiornate",
                "es": "Se agregó documentación sobre DS18B20 en una Raspberry Pi; Dependencias actualizadas",
                "pl": "Dodano dokumentację dotyczącą DS18B20 na Raspberry Pi; Zależności zaktualizowane",
                "zh-cn": "在Raspberry Pi上添加了有关DS18B20的文档；依赖关系已更新"
            },
            "1.0.2": {
                "en": "Display error message when tried to search for sensors without adapter running.",
                "de": "Zeigt eine Fehlermeldung an, wenn versucht wird nach Sensoren zu suchen, ohne dass der Adapter ausgeführt wird.",
                "ru": "Отображать сообщение об ошибке при попытке поиска датчиков без работающего адаптера.",
                "pt": "Exibir mensagem de erro ao tentar procurar sensores sem o adaptador em execução.",
                "nl": "Geef een foutmelding weer wanneer u probeert te zoeken naar sensoren zonder adapter.",
                "fr": "Affiche un message d'erreur lorsque vous essayez de rechercher des capteurs sans adaptateur en cours d'exécution.",
                "it": "Visualizza il messaggio di errore quando si tenta di cercare sensori senza l'adattatore in funzione.",
                "es": "Muestra un mensaje de error cuando intenta buscar sensores sin el adaptador en ejecución.",
                "pl": "Wyświetl komunikat o błędzie podczas próby wyszukania czujników bez uruchomionego adaptera.",
                "zh-cn": "尝试在没有运行适配器的情况下搜索传感器时显示错误消息。"
            },
            "1.0.1": {
                "en": "Type changed to hardware, Renamed command, Added missing documentation",
                "de": "Typ geändert in Hardware, Befehl umbenannt, fehlende Dokumentation hinzugefügt",
                "ru": "Тип изменен на аппаратное обеспечение, команда переименована, добавлена недостающая документация",
                "pt": "Tipo alterado para hardware, comando renomeado, documentação ausente adicionada",
                "nl": "Type gewijzigd in hardware, opdracht Hernoemd, ontbrekende documentatie toegevoegd",
                "fr": "Type modifié en matériel, commande renommée, documentation manquante ajoutée",
                "it": "Tipo modificato in hardware, comando rinominato, aggiunta documentazione mancante",
                "es": "Tipo cambiado a hardware, comando renombrado, documentación faltante agregada",
                "pl": "Zmieniono typ na sprzęt, zmieniono nazwę polecenia, dodano brakującą dokumentację",
                "zh-cn": "将类型更改为硬件，重命名命令，添加了缺少的文档"
            },
            "1.0.0": {
                "en": "initial release",
                "de": "Erstveröffentlichung",
                "ru": "Начальная версия",
                "pt": "lançamento inicial",
                "nl": "Eerste uitgave",
                "fr": "Première version",
                "it": "Versione iniziale",
                "es": "Versión inicial",
                "pl": "Pierwsze wydanie",
                "zh-cn": "首次出版"
            }
        },
        "title": "DS18B20",
        "desc": {
            "en": "This is an ioBroker-Adapter to integrate DS18B20 1-wire temperature sensors.",
            "de": "Dies ist ein ioBroker-Adapter zur Integration von DS18B20 1-Wire Temperatursensoren.",
            "ru": "Это адаптер ioBroker для интеграции однопроводных датчиков температуры DS18B20.",
            "pt": "Este é um adaptador ioBroker para integrar os sensores de temperatura DS18B20 de 1 fio.",
            "nl": "Dit is een ioBroker-adapter om DS18B20 1-draads temperatuursensoren te integreren.",
            "fr": "C'est un adaptateur ioBroker pour intégrer les capteurs de température DS18B20 à 1 fil.",
            "it": "Questo è un adattatore ioBroker per integrare i sensori di temperatura a 1 filo DS18B20.",
            "es": "Este es un adaptador ioBroker para integrar sensores de temperatura DS18B20 de 1 cable.",
            "pl": "Jest to adapter ioBroker do integracji 1-przewodowych czujników temperatury DS18B20.",
            "zh-cn": "这是一款集成DS18B20单线温度传感器的ioBroker-Adapter。"
        },
        "docs": {
            "en": "docs/en/ds18b20.md",
            "de": "docs/de/ds18b20.md"
        },
        "authors": [
            "Peter Müller <peter@crycode.de>"
        ],
        "keywords": [
            "ds18b20",
            "ds1820",
            "1wire"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "build/main.js",
        "icon": "ds18b20.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/crycode-de/ioBroker.ds18b20/master/admin/ds18b20.png",
        "readme": "https://github.com/crycode-de/ioBroker.ds18b20/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "hardware",
        "compact": true,
        "materialize": true,
        "messagebox": true,
        "dependencies": [
            {
                "js-controller": ">=1.4.2"
            }
        ]
    },
    "native": {
        "defaultInterval": 60000
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "All sensors connected",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "actions",
            "type": "channel",
            "common": {
                "name": "Actions"
            },
            "native": {}
        },
        {
            "_id": "actions.readNow",
            "type": "state",
            "common": {
                "role": "text",
                "name": "Read one or all sensors now",
                "type": "text",
                "read": false,
                "write": true,
                "def": ""
            },
            "native": {}
        },
        {
            "_id": "sensors",
            "type": "channel",
            "common": {
                "name": "The sensors"
            },
            "native": {}
        }
    ]
}
