{
    "%s (disabled)": "%s (deaktiviert)",
    "Address": "Adresse",
    "After that you have to edit the created '.env' file and fill in at least the host and the encryption key.": "Danach muss die erstellte '.env' Datei bearbeitet und mindestens der Host und der Verschlüsselungsschlüssel eingetragen werden.",
    "Click here to create a new random encryption key": "Hier klicken, um einen neuen zufälligen Verschlüsselungsschlüssel zu erstellen",
    "Click here to search for sensors and add the found sensors to the list.": "Hier klicken, um nach Sensoren zu suchen und die gefundenen Sensoren zur Liste hinzuzufügen.",
    "Connected remote systems": "Verbundene Remote-Systeme",
    "Decimals": "Dezimalstellen",
    "Default query interval": "Standardabfrageintervall",
    "Enable remote sensors": "Remote-Sensoren aktivieren",
    "Enabled": "Aktiviert",
    "Encryption key": "Verschlüsselungsschlüssel",
    "Enter a name": "Namen eingeben",
    "Factor": "Faktor",
    "Hint: Reopen this page to refresh the list of connected remote systems.": "Hinweis: Diese Seite erneut öffnen, um die Liste der verbundenen Remote-Systeme zu aktualisieren.",
    "If a sensor is connected to a remote system, enter the system ID. Otherwise leave the field empty.": "Wenn ein Sensor mit einem Remote-System verbunden ist die System-ID eingeben. Andernfalls lassen das Feld leer lassen.",
    "If you have lots of sensors on different bus masters, you may use one adapter instance per bus master to optimize the query performance. To do so use the direct path to one bus master, e.g. '/sys/bus/w1/devices/w1_bus_master1'.": "Wenn viele Sensoren an verschiedenen Busmastern vorhanden sind, kann zur Optimierung der Abfrageleistung eine Adapterinstanz pro Busmaster verwendet werden. Dazu den direkten Pfad zu einem Busmaster eintragen, z.B. '/sys/bus/w1/devices/w1_bus_master1'.",
    "Key to encrypt the client connections. This key must be set on all clients. Use the button on the right to create a new key.": "Schlüssel zum Verschlüsseln der Clientverbindungen. Dieser Schlüssel muss auf allen Clients bekannt sein. Über den Button rechts kann ein neuer Schlüssel erzeugt werden.",
    "Name": "Name",
    "Null on error": "Null bei Fehler",
    "Offset": "Offset",
    "Path of the 1-wire devices": "Pfad der 1-Wire Geräte",
    "Query interval": "Abfrageintervall",
    "Remote client setup instructions": "Anweisungen zur Einrichtung von Remote-Clients",
    "Remote system ID": "Remote-System-ID",
    "Remote systems": "Remote-Systeme",
    "Search for sensors": "Suche nach Sensoren",
    "Sensors": "Sensoren",
    "Server port": "Server Port",
    "System path where the 1-wire devices can be accessed. Default is '/sys/bus/w1/devices'.": "Systempfad, über den auf die 1-Wire Geräte zugegriffen werden kann. Standard ist '/sys/bus/w1/devices'.",
    "The adapter instance must be started to search for sensors.": "Die Adapterinstanz muss gestartet sein, um nach Sensoren zu suchen.",
    "The default time between sensor queries in milliseconds.": "Die Standardzeit zwischen Sensorabfragen in Millisekunden.",
    "The port to start the server for remote clients on. Default is '1820'.": "Der Port, an dem der Server für Remote-Clients gestartet werden soll. Standard ist '1820'.",
    "Then you may start the remote client manually or as a SystemD service like shown in the setup output.": "Anschließend kann der Client manuell oder als SystemD-Dienst gestartet werden, wie in der Ausgabe des Setups gezeigt.",
    "To setup a remote client please make sure Node.js is installed and run the following commands on the remote system. This will create all necessary files in '~/ds18b20-remote/' to run the remote client.": "Um einen Remote-Client einzurichten, bitte sicherstellen, dass Node.js installiert ist und dann die folgenden Befehle auf dem Remote-System ausführen. Dadurch werden alle erforderlichen Dateien zum Ausführen des Clients in '~/ds18b20-remote/' erstellt.",
    "Unit": "Einheit",
    "When enabled the adapter starts a server and accepts connections from ioBroker.ds18b20 remote clients.": "Wenn aktiviert, startet der Adapter einen Server und akzeptiert Verbindungen von ioBroker.ds18b20 Remote Clients.",
    "You may search for sensors or add them manually by providing their address.": "Sensoren können automatische gesucht, oder manuell durch Eingabe der Adresse hinzugefügt werden."
}
