{
    "%s (disabled)": "%s (deshabilitado)",
    "Address": "Dirección",
    "After that you have to edit the created '.env' file and fill in at least the host and the encryption key.": "Después de eso, debe editar el archivo '.env' creado y completar al menos el host y la clave de cifrado.",
    "Click here to create a new random encryption key": "Haga clic aquí para crear una nueva clave de cifrado aleatoria",
    "Click here to search for sensors and add the found sensors to the list.": "Haga clic aquí para buscar sensores y agregar los sensores encontrados a la lista.",
    "Connected remote systems": "Sistemas remotos conectados",
    "Decimals": "Decimales",
    "Default query interval": "Intervalo de consulta predeterminado",
    "Enable remote sensors": "Habilitar sensores remotos",
    "Enabled": "Activado",
    "Encryption key": "Clave de encriptación",
    "Enter a name": "Ingresa un nombre",
    "Factor": "Factor",
    "Hint: Reopen this page to refresh the list of connected remote systems.": "Sugerencia: Vuelva a abrir esta página para actualizar la lista de sistemas remotos conectados.",
    "If a sensor is connected to a remote system, enter the system ID. Otherwise leave the field empty.": "Si un sensor está conectado a un sistema remoto, ingrese la ID del sistema. De lo contrario, deje el campo vacío.",
    "If you have lots of sensors on different bus masters, you may use one adapter instance per bus master to optimize the query performance. To do so use the direct path to one bus master, e.g. '/sys/bus/w1/devices/w1_bus_master1'.": "Si tiene muchos sensores en diferentes maestros de bus, puede usar una instancia de adaptador por maestro de bus para optimizar el rendimiento de la consulta. Para ello, utilice la ruta directa a un maestro de bus, p. '/sys/bus/w1/dispositivos/w1_bus_master1'.",
    "Key to encrypt the client connections. This key must be set on all clients. Use the button on the right to create a new key.": "Clave para cifrar las conexiones del cliente. Esta clave debe configurarse en todos los clientes. Utilice el botón de la derecha para crear una nueva clave.",
    "Name": "Nombre",
    "Null on error": "Nulo por error",
    "Offset": "Compensar",
    "Path of the 1-wire devices": "Ruta de los dispositivos de 1 cable",
    "Query interval": "Intervalo de consulta",
    "Remote client setup instructions": "Instrucciones de configuración de cliente remoto",
    "Remote system ID": "ID del sistema remoto",
    "Remote systems": "Sistemas remotos",
    "Search for sensors": "Buscar sensores",
    "Sensors": "Sensores",
    "Server port": "Puerto de servicio",
    "System path where the 1-wire devices can be accessed. Default is '/sys/bus/w1/devices'.": "Ruta del sistema donde se puede acceder a los dispositivos de 1 cable. El valor predeterminado es '/sys/bus/w1/devices' .",
    "The adapter instance must be started to search for sensors.": "La instancia del adaptador debe iniciarse para buscar sensores.",
    "The default time between sensor queries in milliseconds.": "El tiempo predeterminado entre consultas del sensor en milisegundos.",
    "The port to start the server for remote clients on. Default is '1820'.": "El puerto para iniciar el servidor para clientes remotos. El valor predeterminado es '1820'.",
    "Then you may start the remote client manually or as a SystemD service like shown in the setup output.": "Luego, puede iniciar el cliente remoto manualmente o como un servicio SystemD como se muestra en la salida de configuración.",
    "To setup a remote client please make sure Node.js is installed and run the following commands on the remote system. This will create all necessary files in '~/ds18b20-remote/' to run the remote client.": "Para configurar un cliente remoto, asegúrese de que Node.js esté instalado y ejecute los siguientes comandos en el sistema remoto. Esto creará todos los archivos necesarios para ejecutar el cliente remoto.",
    "Unit": "Unidad",
    "When enabled the adapter starts a server and accepts connections from ioBroker.ds18b20 remote clients.": "Cuando está habilitado, el adaptador inicia un servidor y acepta conexiones de clientes remotos ioBroker.ds18b20.",
    "You may search for sensors or add them manually by providing their address.": "Puede buscar sensores o agregarlos manualmente proporcionando su dirección."
}
