{
    "%s (disabled)": "%s (wyłączone)",
    "Address": "Adres",
    "After that you have to edit the created '.env' file and fill in at least the host and the encryption key.": "Następnie musisz edytować utworzony plik '.env' i podać przynajmniej nazwę hosta i klucz szyfrowania.",
    "Click here to create a new random encryption key": "Kliknij tutaj, aby utworzyć nowy losowy klucz szyfrujący",
    "Click here to search for sensors and add the found sensors to the list.": "Kliknij tutaj, aby wyszukać czujniki i dodać znalezione czujniki do listy.",
    "Connected remote systems": "Połączone systemy zdalne",
    "Decimals": "Liczby dziesiętne",
    "Default query interval": "Domyślny interwał zapytania",
    "Enable remote sensors": "Włącz zdalne czujniki",
    "Enabled": "Włączony",
    "Encryption key": "Klucz szyfrowania",
    "Enter a name": "Wpisz imię",
    "Factor": "Czynnik",
    "Hint: Reopen this page to refresh the list of connected remote systems.": "Wskazówka: Ponownie otwórz tę stronę, aby odświeżyć listę podłączonych systemów zdalnych.",
    "If a sensor is connected to a remote system, enter the system ID. Otherwise leave the field empty.": "Jeśli czujnik jest podłączony do systemu zdalnego, wprowadź identyfikator systemu. W przeciwnym razie pozostaw pole puste.",
    "If you have lots of sensors on different bus masters, you may use one adapter instance per bus master to optimize the query performance. To do so use the direct path to one bus master, e.g. '/sys/bus/w1/devices/w1_bus_master1'.": "Jeśli masz wiele czujników na różnych magistralach głównych, możesz użyć jednej instancji adaptera na magistralę główną, aby zoptymalizować wydajność zapytań. W tym celu należy skorzystać z bezpośredniej ścieżki do jednego mastera magistrali, np. „/sys/bus/w1/urządzenia/w1_bus_master1”.",
    "Key to encrypt the client connections. This key must be set on all clients. Use the button on the right to create a new key.": "Klucz do szyfrowania połączeń klientów. Ten klucz musi być ustawiony na wszystkich klientach. Użyj przycisku po prawej stronie, aby utworzyć nowy klucz.",
    "Name": "Nazwa",
    "Null on error": "Brak wartości błędu",
    "Offset": "Offset",
    "Path of the 1-wire devices": "Ścieżka urządzeń 1-przewodowych",
    "Query interval": "Interwał zapytania",
    "Remote client setup instructions": "Instrukcje instalacji klienta zdalnego",
    "Remote system ID": "Identyfikator systemu zdalnego",
    "Remote systems": "Systemy zdalne",
    "Search for sensors": "Wyszukaj czujniki",
    "Sensors": "Czujniki",
    "Server port": "Port serwera",
    "System path where the 1-wire devices can be accessed. Default is '/sys/bus/w1/devices'.": "Ścieżka systemowa, do której można uzyskać dostęp do urządzeń 1-przewodowych. Domyślnie jest to '/sys/bus/w1/devices' .",
    "The adapter instance must be started to search for sensors.": "Instancja adaptera musi zostać uruchomiona, aby wyszukać czujniki.",
    "The default time between sensor queries in milliseconds.": "Domyślny czas między zapytaniami czujnika w milisekundach.",
    "The port to start the server for remote clients on. Default is '1820'.": "Port do uruchamiania serwera dla klientów zdalnych. Wartość domyślna to '1820'.",
    "Then you may start the remote client manually or as a SystemD service like shown in the setup output.": "Następnie możesz uruchomić klienta zdalnego ręcznie lub jako usługę SystemD, jak pokazano w danych wyjściowych instalacji.",
    "To setup a remote client please make sure Node.js is installed and run the following commands on the remote system. This will create all necessary files in '~/ds18b20-remote/' to run the remote client.": "Aby skonfigurować klienta zdalnego, upewnij się, że Node.js jest zainstalowany i uruchom następujące polecenia w systemie zdalnym. Spowoduje to utworzenie wszystkich plików niezbędnych do uruchomienia klienta zdalnego.",
    "Unit": "Jednostka",
    "When enabled the adapter starts a server and accepts connections from ioBroker.ds18b20 remote clients.": "Po włączeniu adapter uruchamia serwer i akceptuje połączenia od zdalnych klientów ioBroker.ds18b20.",
    "You may search for sensors or add them manually by providing their address.": "Możesz wyszukać czujniki lub dodać je ręcznie, podając ich adres."
}
