{
    "%s (disabled)": "%s (отключено)",
    "Address": "Адрес",
    "After that you have to edit the created '.env' file and fill in at least the host and the encryption key.": "После этого вы должны отредактировать созданный файл '.env' и указать хотя бы хост и ключ шифрования.",
    "Click here to create a new random encryption key": "Нажмите здесь, чтобы создать новый случайный ключ шифрования",
    "Click here to search for sensors and add the found sensors to the list.": "Щелкните здесь, чтобы выполнить поиск датчиков и добавить найденные датчики в список.",
    "Connected remote systems": "Подключенные удаленные системы",
    "Decimals": "Десятичные",
    "Default query interval": "Интервал запроса по умолчанию",
    "Enable remote sensors": "Включить удаленные датчики",
    "Enabled": "активирован",
    "Encryption key": "Ключ шифрования",
    "Enter a name": "Введите имя",
    "Factor": "фактор",
    "Hint: Reopen this page to refresh the list of connected remote systems.": "Совет: повторно откройте эту страницу, чтобы обновить список подключенных удаленных систем.",
    "If a sensor is connected to a remote system, enter the system ID. Otherwise leave the field empty.": "Если датчик подключен к удаленной системе, введите идентификатор системы. В противном случае оставьте поле пустым.",
    "If you have lots of sensors on different bus masters, you may use one adapter instance per bus master to optimize the query performance. To do so use the direct path to one bus master, e.g. '/sys/bus/w1/devices/w1_bus_master1'.": "Если у вас есть много датчиков на разных мастерах шины, вы можете использовать один экземпляр адаптера на мастер шины, чтобы оптимизировать производительность запросов. Для этого используйте прямой путь к одному мастеру шины, т.е. '/sys/bus/w1/devices/w1_bus_master1'.",
    "Key to encrypt the client connections. This key must be set on all clients. Use the button on the right to create a new key.": "Ключ для шифрования клиентских подключений. Этот ключ должен быть установлен на всех клиентах. Используйте кнопку справа, чтобы создать новый ключ.",
    "Name": "название",
    "Null on error": "Null по ошибке",
    "Offset": "офсет",
    "Path of the 1-wire devices": "Дорожка 1-проводных приборов",
    "Query interval": "Интервал запроса",
    "Remote client setup instructions": "Инструкции по настройке удаленного клиента",
    "Remote system ID": "ID удаленной системы",
    "Remote systems": "Удаленные системы",
    "Search for sensors": "Поиск датчиков",
    "Sensors": "Датчики",
    "Server port": "Порт сервера",
    "System path where the 1-wire devices can be accessed. Default is '/sys/bus/w1/devices'.": "Системный путь, по которому можно получить доступ к однопроводным устройствам. По умолчанию это '/sys/bus/w1/devices' .",
    "The adapter instance must be started to search for sensors.": "Экземпляр адаптера должен быть запущен для поиска датчиков.",
    "The default time between sensor queries in milliseconds.": "Время по умолчанию между запросами датчиков в миллисекундах.",
    "The port to start the server for remote clients on. Default is '1820'.": "Порт для запуска сервера для удаленных клиентов. По умолчанию '1820'.",
    "Then you may start the remote client manually or as a SystemD service like shown in the setup output.": "Затем вы можете запустить удаленный клиент вручную или как службу SystemD, как показано в выходных данных настройки.",
    "To setup a remote client please make sure Node.js is installed and run the following commands on the remote system. This will create all necessary files in '~/ds18b20-remote/' to run the remote client.": "Чтобы настроить удаленный клиент, убедитесь, что установлен Node.js, и выполните следующие команды в удаленной системе. Это создаст все необходимые файлы для запуска удаленного клиента.",
    "Unit": "Единица измерения",
    "When enabled the adapter starts a server and accepts connections from ioBroker.ds18b20 remote clients.": "При включении адаптер запускает сервер и принимает соединения от удаленных клиентов ioBroker.ds18b20.",
    "You may search for sensors or add them manually by providing their address.": "Вы можете искать датчики или добавлять их вручную, указав их адрес."
}
