{
    "%s (disabled)": "%s (вимкнено)",
    "Address": "Адреса",
    "After that you have to edit the created '.env' file and fill in at least the host and the encryption key.": "Після цього вам потрібно відредагувати створений файл «.env» і заповнити принаймні хост і ключ шифрування.",
    "Click here to create a new random encryption key": "Натисніть тут, щоб створити новий випадковий ключ шифрування",
    "Click here to search for sensors and add the found sensors to the list.": "Натисніть тут, щоб знайти датчики та додати знайдені датчики до списку.",
    "Connected remote systems": "Підключені віддалені системи",
    "Decimals": "Десяткові дроби",
    "Default query interval": "Інтервал запиту за замовчуванням",
    "Enable remote sensors": "Увімкнути дистанційні датчики",
    "Enabled": "Увімкнено",
    "Encryption key": "Ключ шифрування",
    "Enter a name": "Введіть назву",
    "Factor": "Фактор",
    "Hint: Reopen this page to refresh the list of connected remote systems.": "Підказка: повторно відкрийте цю сторінку, щоб оновити список підключених віддалених систем.",
    "If a sensor is connected to a remote system, enter the system ID. Otherwise leave the field empty.": "Якщо датчик підключено до віддаленої системи, введіть ідентифікатор системи. В іншому випадку залиште поле порожнім.",
    "If you have lots of sensors on different bus masters, you may use one adapter instance per bus master to optimize the query performance. To do so use the direct path to one bus master, e.g. '/sys/bus/w1/devices/w1_bus_master1'.": "Якщо у вас є багато датчиків на різних головних шинах, ви можете використовувати один екземпляр адаптера на головну шину, щоб оптимізувати продуктивність запитів. Для цього використовуйте прямий шлях до одного майстра шини, напр. '/sys/bus/w1/devices/w1_bus_master1'.",
    "Key to encrypt the client connections. This key must be set on all clients. Use the button on the right to create a new key.": "Ключ для шифрування підключень клієнта. Цей ключ потрібно встановити на всіх клієнтах. Скористайтеся кнопкою праворуч, щоб створити новий ключ.",
    "Name": "Ім'я",
    "Null on error": "Нуль у разі помилки",
    "Offset": "Зсув",
    "Path of the 1-wire devices": "Шлях 1-провідних пристроїв",
    "Query interval": "Інтервал запиту",
    "Remote client setup instructions": "Інструкції з налаштування віддаленого клієнта",
    "Remote system ID": "ID віддаленої системи",
    "Remote systems": "Дистанційні системи",
    "Search for sensors": "Пошук датчиків",
    "Sensors": "Датчики",
    "Server port": "Порт сервера",
    "System path where the 1-wire devices can be accessed. Default is '/sys/bus/w1/devices'.": "Системний шлях, де можна отримати доступ до пристроїв 1-wire. Типовим є '/sys/bus/w1/devices'.",
    "The adapter instance must be started to search for sensors.": "Для пошуку датчиків потрібно запустити екземпляр адаптера.",
    "The default time between sensor queries in milliseconds.": "Стандартний час між запитами датчика в мілісекундах.",
    "The port to start the server for remote clients on. Default is '1820'.": "Порт для запуску сервера для віддалених клієнтів. За замовчуванням — «1820».",
    "Then you may start the remote client manually or as a SystemD service like shown in the setup output.": "Потім ви можете запустити віддаленого клієнта вручну або як службу SystemD, як показано у вихідних даних налаштування.",
    "To setup a remote client please make sure Node.js is installed and run the following commands on the remote system. This will create all necessary files in '~/ds18b20-remote/' to run the remote client.": "Щоб налаштувати віддаленого клієнта, переконайтеся, що Node.js інстальовано, і виконайте наведені нижче команди у віддаленій системі. Це створить усі необхідні файли в '~/ds18b20-remote/' для запуску віддаленого клієнта.",
    "Unit": "одиниця",
    "When enabled the adapter starts a server and accepts connections from ioBroker.ds18b20 remote clients.": "Якщо ввімкнено, адаптер запускає сервер і приймає підключення від ioBroker.ds18b20 віддалених клієнтів.",
    "You may search for sensors or add them manually by providing their address.": "Ви можете шукати датчики або додавати їх вручну, вказуючи їх адресу."
}
