{
    "<em>Hint:</em> Click on the ?-button at the top to get help and some examples.": "<em>Dica:</em> clique no botão ? - na parte superior para obter ajuda e alguns exemplos.",
    "Add entry": "Adicionar entrada",
    "Address": "Endereço",
    "After that you have to edit the created <code>.env</code> file and fill in at least the host and the encryption key.": "Depois disso, você deve editar o arquivo <code>.env</code> criado e preencher pelo menos o host e a chave de criptografia.",
    "Allowed chars: a-z A-Z 0-9 - _": "Caracteres permitidos: a-z A-Z 0-9 - _",
    "Connected remote systems": "Sistemas remotos conectados",
    "Decimals": "Decimais",
    "Default query interval": "Intervalo de consulta padrão",
    "Duplicate addresses are not allowed": "Endereços duplicados não são permitidos",
    "Empty names are not allowed": "Nomes vazios não são permitidos",
    "Enable remote sensors": "Habilitar sensores remotos",
    "Encryption key": "Chave de encriptação",
    "Error": "Erro",
    "Factor": "Fator",
    "Invalid address": "Endereço inválido",
    "Invalid interval, must be greater than 500": "Intervalo inválido, deve ser maior que 500",
    "Invalid system ID": "ID de sistema inválido",
    "Key to encrypt the client connections. This key must be set on all clients. Use the button on the right to create a new key.": "Chave para criptografar as conexões do cliente. Essa chave deve ser definida em todos os clientes. Use o botão à direita para criar uma nova chave.",
    "Name": "Nome",
    "No response!": "Sem resposta!",
    "Null on error": "Nulo em erro",
    "Offset": "Deslocamento",
    "Path of the 1-wire devices": "Caminho dos dispositivos de 1 fio",
    "Query interval": "Intervalo de consulta",
    "Remote client setup instructions": "Instruções de configuração do cliente remoto",
    "Remote system ID": "ID do sistema remoto",
    "Search Sensors": "Sensores de pesquisa",
    "Server port": "Porta do servidor",
    "Something seems to be wrong. Please check the highlighted fields.": "Algo parece estar errado. Por favor, verifique os campos destacados.",
    "System path where the 1-wire devices can be accessed. Default is <code>/sys/bus/w1/devices</code>.": "Caminho do sistema em que os dispositivos de 1 fio podem ser acessados. O padrão é <code>/sys/bus/w1/devices</code> .",
    "The adapter instance must be started to search for sensors.": "A instância do adaptador deve ser iniciada para procurar sensores.",
    "The default time between sensor queries in milliseconds.": "O tempo padrão entre as consultas do sensor em milissegundos.",
    "The port to start the server for remote clients on. Default is <code>1820</code>.": "A porta para iniciar o servidor para clientes remotos. O padrão é <code>1820</code>.",
    "Then you may start the remote client manually or as a SystemD service like shown in the setup output.": "Em seguida, você pode iniciar o cliente remoto manualmente ou como um serviço SystemD, conforme mostrado na saída de configuração.",
    "To setup a remote client please make sure Node.js is installed and run the following commands on the remote system. This will create all necessary files to run the remote client.": "Para configurar um cliente remoto, certifique-se de que o Node.js esteja instalado e execute os seguintes comandos no sistema remoto. Isso criará todos os arquivos necessários para executar o cliente remoto.",
    "Unit": "Unidade",
    "When enabled the adapter starts a server and accepts connections from <em>ioBroker.ds18b20 remote clients</em>. (see below)": "Quando ativado, o adaptador inicia um servidor e aceita conexões de <em>clientes remotos ioBroker.ds18b20</em>. (ver abaixo)"
}